MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX110F016D.PIC
      <edc:SFRDef edc:_addr="0x1F886240" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------nnnnnn----" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff03f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------000000----" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------------000000----" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC4" edc:desc="" edc:mask="0x1" edc:name="ODCC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC5" edc:desc="" edc:mask="0x1" edc:name="ODCC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886250" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC4" edc:desc="" edc:mask="0x1" edc:name="CNPUC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC5" edc:desc="" edc:mask="0x1" edc:name="CNPUC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC6" edc:desc="" edc:mask="0x1" edc:name="CNPUC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC7" edc:desc="" edc:mask="0x1" edc:name="CNPUC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC8" edc:desc="" edc:mask="0x1" edc:name="CNPUC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886260" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDC0" edc:desc="" edc:mask="0x1" edc:name="CNPDC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC3" edc:desc="" edc:mask="0x1" edc:name="CNPDC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC4" edc:desc="" edc:mask="0x1" edc:name="CNPDC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC5" edc:desc="" edc:mask="0x1" edc:name="CNPDC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC6" edc:desc="" edc:mask="0x1" edc:name="CNPDC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC7" edc:desc="" edc:mask="0x1" edc:name="CNPDC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC8" edc:desc="" edc:mask="0x1" edc:name="CNPDC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC9" edc:desc="" edc:mask="0x1" edc:name="CNPDC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886270" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------n-n-------------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886280" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------nnnnnnnnnn" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc003ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------------xxxxxxxxxx" edc:name="CNENC" edc:nzwidth="0x20" edc:por="0000000000------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEC0" edc:desc="" edc:mask="0x1" edc:name="CNIEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC3" edc:desc="" edc:mask="0x1" edc:name="CNIEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC4" edc:desc="" edc:mask="0x1" edc:name="CNIEC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC5" edc:desc="" edc:mask="0x1" edc:name="CNIEC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC6" edc:desc="" edc:mask="0x1" edc:name="CNIEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC7" edc:desc="" edc:mask="0x1" edc:name="CNIEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC8" edc:desc="" edc:mask="0x1" edc:name="CNIEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC9" edc:desc="" edc:mask="0x1" edc:name="CNIEC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886290" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------nnnnnnnnnn" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATC0" edc:desc="" edc:mask="0x1" edc:name="CNSTATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC3" edc:desc="" edc:mask="0x1" edc:name="CNSTATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC4" edc:desc="" edc:mask="0x1" edc:name="CNSTATC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC5" edc:desc="" edc:mask="0x1" edc:name="CNSTATC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC6" edc:desc="" edc:mask="0x1" edc:name="CNSTATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC7" edc:desc="" edc:mask="0x1" edc:name="CNSTATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC8" edc:desc="" edc:mask="0x1" edc:name="CNSTATC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC9" edc:desc="" edc:mask="0x1" edc:name="CNSTATC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="RPC6" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="RPC7" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RC8"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="RPC8" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RC9"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="CTED7"/>
      <edc:VirtualPin edc:name="RPC9" edc:ppsgroup="4" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="RPB11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="RPB13" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="PGED4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="CTED8"/>
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="PGEC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="1" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="RPA0" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RPA1" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="RPC0" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="RPA2" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="RPA3" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RA8"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RPA8" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="RPB4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPA4" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RA9"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RPA9" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="RPC3" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="RPC4" edc:ppsgroup="4" edc:ppsval="7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="RPC5" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="1" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:Pin>
